<a href="https://colab.research.google.com/github/ajk22/ClassWork1/blob/master/Final_GroupAssignment3_IST210.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [23]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [24]:
%sql sqlite:///cyberHotelDatabase.db

'Connected: @cyberHotelDatabase.db'

In [25]:
%%sql  
DROP TABLE IF EXISTS Hotel;
CREATE TABLE Hotel(hotel_id text primaray key, address text, hotel_name text, owner_name text);

 * sqlite:///cyberHotelDatabase.db
Done.
Done.

[]

In [26]:
%%sql  
INSERT INTO Hotel VALUES('11111','321 Hotel Street, State College PA','Hotel #1','Tom Brady');
INSERT INTO Hotel VALUES('22222','101 Motel Road, Pittsburgh PA','Hotel #2','Wiz Khalifa');
INSERT INTO Hotel VALUES('33333','1200 Lodge Lane, Erie PA','Hotel #3','Mike Wazowski');
INSERT INTO Hotel VALUES('44444','55 Hotel Way, Seattle WA','Hotel #4','Lebron James');
INSERT INTO Hotel VALUES('55555','001 Hotel Highway, Columbus OH','Hotel #4','John Stamos')

 * sqlite:///cyberHotelDatabase.db
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [27]:
%%sql
SELECT * FROM Hotel;

 * sqlite:///cyberHotelDatabase.db
Done.

[('11111', '321 Hotel Street, State College PA', 'Hotel #1', 'Tom Brady'),
 ('22222', '101 Motel Road, Pittsburgh PA', 'Hotel #2', 'Wiz Khalifa'),
 ('33333', '1200 Lodge Lane, Erie PA', 'Hotel #3', 'Mike Wazowski'),
 ('44444', '55 Hotel Way, Seattle WA', 'Hotel #4', 'Lebron James'),
 ('55555', '001 Hotel Highway, Columbus OH', 'Hotel #4', 'John Stamos')]

In [28]:
%%sql  
DROP TABLE IF EXISTS Guest;
CREATE TABLE Guest(guest_id text primaray key, hotel_id text, first_name text, last_name text, date_of_birth text, room_number text);

 * sqlite:///cyberHotelDatabase.db
Done.
Done.

[]

In [29]:
%%sql
INSERT INTO Guest VALUES('db321','11111','Don','Roberto','09/13/80','322');
INSERT INTO Guest VALUES('jj451','11111','Julio','Jones','02/08/89','114');
INSERT INTO Guest VALUES('ss282','22222','Smitty','Smith','06/22/68','110');
INSERT INTO Guest VALUES('bs553','11111','Bobby','Shmurda','08/04/94','304');
INSERT INTO Guest VALUES('sb420','33333','Sponge','Bob','01/01/91','229');

 * sqlite:///cyberHotelDatabase.db
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [30]:
%%sql
SELECT * FROM Guest;

 * sqlite:///cyberHotelDatabase.db
Done.

[('db321', '11111', 'Don', 'Roberto', '09/13/80', '322'),
 ('jj451', '11111', 'Julio', 'Jones', '02/08/89', '114'),
 ('ss282', '22222', 'Smitty', 'Smith', '06/22/68', '110'),
 ('bs553', '11111', 'Bobby', 'Shmurda', '08/04/94', '304'),
 ('sb420', '33333', 'Sponge', 'Bob', '01/01/91', '229')]

In [31]:
%%sql  
DROP TABLE IF EXISTS Room;
CREATE TABLE Room(room_number text primaray key, hotel_id text, floor_number text, bed_size text);

 * sqlite:///cyberHotelDatabase.db
Done.
Done.

[]

In [32]:
%%sql
INSERT INTO Room VALUES('322','11111','3','Queen');
INSERT INTO Room VALUES('114','11111','1','King');
INSERT INTO Room VALUES('110','22222','1','Twin');
INSERT INTO Room VALUES('304','11111','1','King');
INSERT INTO Room VALUES('229','33333','2','Queen');

 * sqlite:///cyberHotelDatabase.db
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [33]:
%%sql
SELECT * FROM Room;

 * sqlite:///cyberHotelDatabase.db
Done.

[('322', '11111', '3', 'Queen'),
 ('114', '11111', '1', 'King'),
 ('110', '22222', '1', 'Twin'),
 ('304', '11111', '1', 'King'),
 ('229', '33333', '2', 'Queen')]

In [34]:
%%sql
DROP TABLE IF EXISTS Transactions;
CREATE TABLE Transactions(transaction_id text primary key, guest_id text, rental_id text, card_number text, date text, transaction_amount real);

 * sqlite:///cyberHotelDatabase.db
Done.
Done.

[]

In [35]:
%%sql
INSERT INTO Transactions VALUES('00001','jj451','02001','1111-1111-1111-1112','11/29/19',220.91);
INSERT INTO Transactions VALUES('00002','jj451','04131','1111-1111-1111-1112','11/30/19',185.42);
INSERT INTO Transactions VALUES('00003','jj451','06731','1111-1111-1111-1112','11/30/19',202.80);
INSERT INTO Transactions VALUES('00004','sb420','09831','1111-2222-3333-4444','03/22/20',197.03);
INSERT INTO Transactions VALUES('00005','ss828','01022','9999-8888-7777-6666','04/19/20',340.64);

 * sqlite:///cyberHotelDatabase.db
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [36]:
%%sql
SELECT * FROM Transactions;

 * sqlite:///cyberHotelDatabase.db
Done.

[('00001', 'jj451', '02001', '1111-1111-1111-1112', '11/29/19', 220.91),
 ('00002', 'jj451', '04131', '1111-1111-1111-1112', '11/30/19', 185.42),
 ('00003', 'jj451', '06731', '1111-1111-1111-1112', '11/30/19', 202.8),
 ('00004', 'sb420', '09831', '1111-2222-3333-4444', '03/22/20', 197.03),
 ('00005', 'ss828', '01022', '9999-8888-7777-6666', '04/19/20', 340.64)]

In [37]:
%%sql
DROP TABLE IF EXISTS Rentals;
CREATE TABLE Rentals(rental_id text primary key, guest_id text, rental_type text, day_limit text);

 * sqlite:///cyberHotelDatabase.db
Done.
Done.

[]

In [38]:
%%sql
INSERT INTO Rentals VALUES('02001','jj451','PS5','4');
INSERT INTO Rentals VALUES('04131','jj451','X Box','3');
INSERT INTO Rentals VALUES('06731','jj451','iPad Pro','2');
INSERT INTO Rentals VALUES('09831','sb420','Smart Toaster','1');
INSERT INTO Rentals VALUES('01022','ss828','Mac Book','2');

 * sqlite:///cyberHotelDatabase.db
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [39]:
%%sql
SELECT * FROM Rentals;

 * sqlite:///cyberHotelDatabase.db
Done.

[('02001', 'jj451', 'PS5', '4'),
 ('04131', 'jj451', 'X Box', '3'),
 ('06731', 'jj451', 'iPad Pro', '2'),
 ('09831', 'sb420', 'Smart Toaster', '1'),
 ('01022', 'ss828', 'Mac Book', '2')]

In [40]:
%%sql
DROP TABLE IF EXISTS Employee;
CREATE TABLE Employee(employee_id text, hotel_id text, first_name text, last_name text, position text);

 * sqlite:///cyberHotelDatabase.db
Done.
Done.

[]

In [41]:
%%sql
INSERT INTO Employee VALUES('abc100','33333','JJ','Watt','Maid');
INSERT INTO Employee VALUES('abc200','33333','Lil','Wayne','Butler');
INSERT INTO Employee VALUES('abc300','11111','Captain','Crunch','Maid');
INSERT INTO Employee VALUES('abc400','22222','Abe','Lincoln','Butler');
INSERT INTO Employee VALUES('abc500','33333','Doctor','Fauci','Maid');

 * sqlite:///cyberHotelDatabase.db
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [42]:
%%sql
SELECT * FROM Employee;

 * sqlite:///cyberHotelDatabase.db
Done.

[('abc100', '33333', 'JJ', 'Watt', 'Maid'),
 ('abc200', '33333', 'Lil', 'Wayne', 'Butler'),
 ('abc300', '11111', 'Captain', 'Crunch', 'Maid'),
 ('abc400', '22222', 'Abe', 'Lincoln', 'Butler'),
 ('abc500', '33333', 'Doctor', 'Fauci', 'Maid')]

## **How many maids does Hotel #3 have employed currently?**

In [43]:
%%sql
SELECT COUNT(position) from Employee WHERE position LIKE '%Maid%' AND hotel_id LIKE '%33333%';

 * sqlite:///cyberHotelDatabase.db
Done.

[(2,)]

## **What devices has Julio Jones rented?**

In [44]:
%%sql
SELECT DISTINCT(rental_type) from Rentals WHERE guest_id LIKE '%jj451';

 * sqlite:///cyberHotelDatabase.db
Done.

[('PS5',), ('X Box',), ('iPad Pro',)]

## **What is the total revenue for all transactions?**

In [45]:
%%sql
SELECT SUM(transaction_amount) from Transactions;

 * sqlite:///cyberHotelDatabase.db
Done.

[(1146.8,)]

# **How much revenue in rentals came in during November?**

In [46]:
%%sql
SELECT SUM(transaction_amount) FROM Transactions WHERE date LIKE "11%";

 * sqlite:///cyberHotelDatabase.db
Done.

[(609.13,)]

# **Why are these questions important?** 

We believe that these questions are relevant because they can potentially relate to real world scenarios in the hotel business. For the first question it is important for a hotel business to keep track of how many employees they have, what the employees are doing, and where they work at. For the second question, this question is relevant because a hotel worker such as a cashier at the front desk may have to pull up information in realtime for a specific guest. The last question is relevant because it is important that hotels keep track of their revenue and earnings, after all it is a business and the purpose of a business is to make money.